package hw_4.fortasks;
/*
5. Вывод чисел от 1 до 10
Задача:
Напишите программу, которая выводит числа от 1 до 10 на экран.
*/
public class DisplayingNumbers {
    public static void main(String[] args) {
        for (int i = 1; i <= 10; i++) {
            System.out.println(i);
        }
    }
}
